{
  "basics": {
    "email": "david.ng.pub@gmail.com",
    "image": "https://avatars.githubusercontent.com/u/2247500",
    "label": "Software Engineer",
    "location": {
      "countryCode": "UK",
      "region": "United Kingdom"
    },
    "name": "David Ng",
    "profiles": [
      {
        "network": "Linkedin",
        "url": "https://www.linkedin.com/in/davidnhk/",
        "username": "Kong Chor Ng"
      },
      {
        "network": "Github",
        "url": "https://github.com/neviaumi",
        "username": "neviaumi"
      }
    ],
    "summary": "Dynamic Software Engineer with a robust foundation in backend and frontend development, specializing in modern frameworks such as React and Node.js. Adept in Agile methodologies and automated testing, I focus on delivering scalable and efficient applications while collaborating with cross-functional teams to align with business objectives. Passionate about continuous improvement and creative problem-solving, I thrive in diverse environments from startups to multinational corporations, fostering growth and innovation in every project.",
    "url": "https://neviaumi.github.io/portfolio?utm_source=resume"
  },
  "colleagueReferences": [
    {
      "references": "content/references/PlayStation.md"
    },
    {
      "references": "content/references/Neat.md"
    },
    {
      "references": "content/references/HK01-team-lead.md"
    },
    {
      "references": "content/references/HK01-team-member.md"
    }
  ],
  "education": [
    {
      "area": "Information Technology",
      "endDate": "2014-05-01",
      "institution": "The Open University of Hong Kong",
      "score": "4.0",
      "startDate": "2012-09-01",
      "studyType": "Bachelor",
      "url": "https://www.hkmu.edu.hk/"
    }
  ],
  "languages": [
    {
      "fluency": "Master",
      "language": "Chinese"
    },
    {
      "fluency": "Intermediate",
      "language": "English"
    }
  ],
  "projects": [
    {
      "description": "My portfolio showcases my evolution as a software engineer, reflecting a blend of technical proficiency and core professional values developed through diverse experiences. It highlights my commitment to creating impactful, scalable solutions by leveraging Agile methodologies across a spectrum of projects. From driving innovation in dynamic tech startups to making significant contributions in global enterprises, I continuously adapt to deliver exceptional software solutions.",
      "highlights": [
        "A comprehensive technical skill set across cutting-edge frontend and backend technologies, honed through extensive hands-on experience.",
        "Automated resume PDF generation and AI-assisted tools for tailored job application workflows, optimizing efficiency.",
        "A diverse set of achievements spanning tech startups and multinational corporations, employing best practices and innovative solutions."
      ],
      "keywords": [
        "React",
        "TypeScript",
        "Astro",
        "TinaCMS",
        "GitHub Actions",
        "Serverless",
        "Playwright",
        "AI Tools",
        "Web Accessibility",
        "Cloudflare Worker"
      ],
      "name": "Portfolio",
      "roles": [
        "Code Owner",
        "Maintainer"
      ],
      "url": "https://neviaumi.github.io/portfolio?utm_source=resume"
    },
    {
      "description": "A web component-driven resume website that dynamically renders a print-ready resume using a remote, schema-compliant JSON. Tailored for seamless updates and compatibility, it ensures effortless customization and consistent formatting across all devices.",
      "highlights": [
        "Dynamic rendering of resumes from remote, schema-compliant JSON for consistent and structured content.",
        "Print-ready, responsive design using TailwindCSS and Web Components for professional presentation.",
        "Seamless integration, enabling quick updates while maintaining content validity against the JSON schema."
      ],
      "keywords": [
        "Web Component",
        "TailwindCSS",
        "JSON Schema",
        "Responsive Design"
      ],
      "name": "resume.json",
      "roles": [
        "Maintainer",
        "Code Owner"
      ],
      "url": "https://github.com/neviaumi/resume.json"
    }
  ],
  "skills": "content/skills/index.json",
  "work": "content/experiences/index.md"
}